package com.yzj.jep.app.enums;

public enum InsRoleStaff {
    //所有负责人
    All_Charge("All_Charge","301000,301020,30520,30540,30750,30760,30780,30800,30820,30850,30870,30880,30900,30920,30940,30960,30980"),
    //中再资产金融产品事业部负责人
    A_301000("301000","301000,301010"),
    //中再资产投资与创新研究中心负责人
    A_301020("301020","301020,301030"),
    //中再资产办公室负责人
    A_30750("30750","30750,30740"),
    //中再资产人力资源部负责人
    A_30760("30760","30760,30770"),
    //中再资产纪委办公室负责人
    A_30780("30780","30780,30790"),
    //中再资产内控与风险管理部负责人
    A_30800("30800","30800,30810"),
    //中再资产评审与信用评级部负责人
    A_30820("30820","30820,30830"),
    //中再资产法律合规部负责人
    A_30850("30850","30850,30840"),
    //中再资产运营管理部经办人
    A_30860("30860","30860,30870"),
    //中再资产信息技术部负责人
    A_30880("30880","30880,30890"),
    //中再资产交易管理部负责人
    A_30900("30900","30900,30910"),
    //中再资产组合管理部负责人
    A_30920("30920","30920,30930"),
    //中再资产固定收益部负责人
    A_30940("30940","30940,30950"),
    //中再资产权益投资部负责人
    A_30960("30960","30960,30970"),
    //中再资产另类投资事业部负责人
    A_30980("30980","30980,30990")
    ;


    String code;
    String desc;

    private InsRoleStaff(String code, String desc) {
        this.code = code;
        this.desc = desc;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getDesc() {
        return desc;
    }

    public void setDesc(String desc) {
        this.desc = desc;
    }
}
